In [2]:
import pandas as pd

data = pd.read_csv('data/TelcomUsers.csv')
data.head(5)

,is_increase,age,Gender,Cellphone,Education_Level,Marital_Status,consume,Level,Total_Relationship_Count
0,0,45,M,3,High School,Married,$60K - $80K,Blue,5
1,0,49,F,5,Graduate,Single,Less than $40K,Blue,6
2,0,51,M,3,Graduate,Married,$80K - $120K,Blue,4
3,0,40,F,4,High School,Unknown,Less than $40K,Blue,3
4,0,40,M,3,Uneducated,Married,$60K - $80K,Blue,5

In [6]:
data.shape

(10127, 9)

In [4]:
data['Level'].value_counts()

Blue        9436
Silver       555
Gold         116
Platinum      20
Name: Level, dtype: int64

In [5]:
data['Marital_Status'].value_counts()

Married     4687
Single      3943
Unknown      749
Divorced     748
Name: Marital_Status, dtype: int64

In [8]:
data[(data.age>21) & (data.age<26)]

data.loc[31 <= data['age'] < 41] = 3;
data.loc[41 <= data['age'] < 50] = 2;
data.loc[50 <= data['age'] < 60] = 1;

Empty DataFrame
Columns: [is_increase, age, Gender, Cellphone, Education_Level, Marital_Status, consume, Level, Total_Relationship_Count]
Index: []

In [20]:
data.loc[data['age'] >= 60, 'age'] = 6;
data.loc[(26<= data['age']) & (data['age'] < 31), 'age'] = 4;
data.loc[(31<= data['age']) & (data['age'] < 41), 'age'] = 3;
data.loc[(41<= data['age']) & (data['age'] < 50), 'age'] = 2;
data.loc[(50<= data['age']) & (data['age'] < 60), 'age'] = 1;

In [27]:
data['Cellphone'].value_counts()

3    2732
2    2655
1    1838
4    1574
0     904
5     424
Name: Cellphone, dtype: int64

In [36]:
data.loc[(data['Cellphone']=='0'), 'Cellphone'] = 1;

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [49]:
data.loc[(data['consume'] == 'Less than $40K'),'consume'] = 31;
data.loc[(data['consume'] == '23'),'consume'] = 32;
data.loc[(data['consume'] == '60ùêæ‚àí80K'),'consume'] = 32;
data.loc[(data['consume'] == '80ùêæ‚àí 120K'),'consume'] = 33;

In [53]:
data['Education_Level'].value_counts()

1                3500
Graduate         3128
Unknown          1519
College          1013
Post-Graduate     516
Doctorate         451
Name: Education_Level, dtype: int64

In [55]:
data.loc[(data['Education_Level'] == 'Graduate'),'Education_Level'] = 2;
data.loc[(data['Education_Level'] == 'College'),'Education_Level'] = 2;

In [56]:
data.loc[(data['Education_Level'] == 'Post-Graduate'),'Education_Level'] = 3;
data.loc[(data['Education_Level'] == 'Doctorate'),'Education_Level'] = 3;

In [61]:
data.to_csv('./data/out1.csv')

In [65]:
data1 = pd.read_csv('data/out1.csv')
data1.head(5)
data1.loc[(data['consume'] == '$40K - $60K'),'consume'] = 32;
data1.loc[(data['consume'] == '$60K - $80K'),'consume'] = 32;
data1.loc[(data['consume'] == '$80K - $120K'),'consume'] = 33;

In [66]:
data1.head(5)

,Unnamed: 0,is_increase,age,Gender,Cellphone,Education_Level,Marital_Status,consume,Level,Total_Relationship_Count
0,0,0,2,M,3,1,Married,$60K - $80K,Blue,5
1,1,0,2,F,5,2,Single,31,Blue,6
2,2,0,1,M,3,2,Married,$80K - $120K,Blue,4
3,3,0,3,F,4,1,Unknown,31,Blue,3
4,4,0,3,M,3,1,Married,$60K - $80K,Blue,5

In [70]:
data1.loc[(data['Cellphone']=='0'), 'Cellphone'] = 21;
data1.loc[(data['Cellphone']=='1'), 'Cellphone'] = 21;
data1.loc[(data['Cellphone']=='2'), 'Cellphone'] = 21;

In [71]:
data1.loc[(data['Cellphone']=='3'), 'Cellphone'] = 22;
data1.loc[(data['Cellphone']=='4'), 'Cellphone'] = 22;
data1.loc[(data['Cellphone']=='5'), 'Cellphone'] = 22;

In [72]:
data1.to_csv('./data/out.csv')

In [ ]:
data.head()